function handleKeyPress(event) {
    if (event.key === "Enter") {
        sendMessage();
    }
}

function sendMessage() {
    var userInput = document.getElementById("userInput").value;
    if (userInput.trim() === "") return;

    var chatBox = document.getElementById("chatBox");
    var userMessage = document.createElement("div");
    userMessage.className = "chat-message sent";
    userMessage.textContent = userInput;

    chatBox.appendChild(userMessage);
    document.getElementById("userInput").value = ""; // Clear input field

    // Simulate a delay before responding
    setTimeout(function () {
        // Simulate a response from the chatbot based on user input
        var botMessage = document.createElement("div");
        botMessage.className = "chat-message received";

        // Check for keywords in user input and provide responses
        if (containsKeyword(userInput, ["Привет", "Здрасти", "Здравей", "Здравейте", "здрасти", "привет", "здравей", "здравейте"]))
        {
            botMessage.textContent = "Здравей, с какво да ти помогна?";
        } 
        else if (containsKeyword(userInput, ["Какъв университет е Минно-геоложкия университет?"])) 
        {
            botMessage.textContent = "МГУ Св. Иван Рилски е единственото висше училище в България, което осигурява висококачествено образование в областта на проучването, добива и преработка на минерални и енергийни суровини. Минно-геоложкия университет е учебен и научен център, където се подготвят инженери по геоложки, минни и електромеханични специалности. Провеждат се фундаментални и приложни научни изследвания и се осъществяват всички форми за следдипломна квалификация.";
        }
        else if (containsKeyword(userInput, ["Къде се намира Вашия университет?"]))
        {
            botMessage.textContent = "МГУ се намира в град София на територията на Студентски град, разположен в поднижието на Витоша.";
        }
       else if (containsKeyword(userInput, ["Как да стигна до университета?"]))
        {
        botMessage.innerHTML = "До Университета може да се стигне с градски транспорт и с метро.<br>" +
                               "С метро:<br>" +
                               "Слизате на Станция Г. Димитров (метро линия 1 и 4)<br>" +
                               "С автобус слизате на спирка Минно-геоложки Университет Свети Иван Рилски<br>" +
                               "Номер 88,414,67,69,294<br>" +
                               "Спирка НСБАЛ по Онкология (метро станция Г. Димитров) 280,123<br>" +
                               "Спирка бул. Г. Димитров с автобус номер 94,69,70";
        }
        else if (containsKeyword(userInput, ["Какво е работното време на Университета?"]))
        {
            botMessage.textContent = "Администрация e с работно време от 08:00 до 16:30ч.";
        }
        else if (containsKeyword(userInput, ["Как мога да кандидаствам във Вашия Университет? Изисква ли се явяване на изпит?"]))
        {
            botMessage.textContent = "В МГУ се влиза без изпит. Нужна е диплома за завършено средно образование плюс успешно положен държавен зрелостен изпит по Математика, физика, български език и литература.";
        }
        else if (containsKeyword(userInput, ["Какви документи са необходими за кандидастване? Как се подават и къде?"]))
        {
            botMessage.innerHTML = "Кандидат-студентите подават онлайн или на място в Приемна \"Кандидат-студенти\" на МГУ или в регионалните бюра на центъра за кандидат-студентска подготовка и информация. Комплекта от документи включва:<br>" +
            "<br>" +
            "-> Заявление-Декларация за кандидастване.<br>" +
            "-> Диплома за завършено средно образование. Кандидастващите на място в Приемна Кандидат-студенти представят оригинала и копие на дипломата. След сравняване оригиналът се връща на притежателя. Кандидастващите онлайн изпращат сканирано копие на дипломата. Оригиналът се представя за сверка при записване.<br>" +
            "-> Платена кандидат-студентска такса (платежно нареждане).";
        }
        else if (containsKeyword(userInput, ["Кога стартира кандидат-студентската кампания?"]))
        {
            botMessage.textContent = "По всяко време на годината сме в кампания (целогодишно).";
        }
        else if (containsKeyword(userInput, ["Какви специалности предлага МГУ?"]))
        {
            botMessage.innerHTML = "Практиката на МГУ е да се обучават студенти, които могат да се реализират в следните специалности, които са разделени на три факултета:<br>" +
            "<br>" +
            "-> Миннотехнологичен факултет (МТФ)<br>" +
            "-> Минноелектромеханичен факултет (МЕМФ)<br>" +
            "-> Геолопроучвателен факултет (ГПФ)<br>" +
            "<br>" +
            "За да разберете МТФ какви бакалавърски програми предлага, моля натиснете опция 1.<br>" +
            "<br>" + 
            "-> Маркшайдерство и геодезия<br>" +
            "-> Обогатяване и рециклиране на суровини<br>" +
            "-> Подземно строителство<br>" +
            "-> Разработване на полезни изкопаеми<br>" +
            "-> Управление на ресурси и производствени системи<br>" +
            "<br>" + 
            "За да разберете МЕМФ какви бакалавърски програми предлага, моля натиснете опция 2.<br>" +
            "<br>" + 
            "-> Автоматика, информационна и управляваща техника<br>" +
            "-> Газова, горивна и пречиствателна техника и технологии<br>" +
            "-> Компютърни технологии и инженерна дейност<br>" +
            "-> Комплексна механизация и компютърно проектиране в машиностроенето<br>" +
            "<br>" + 
            "За да разберете ГПФ какви бакалавърски програми предлага, моля натиснете опция 3.<br>" +
            "<br>" + 
            "-> Биотехнологии<br>" +
            "-> Геология и информатика<br>" +
            "-> Геология и проучване на минерални и енергийни ресурси<br>" +
            "-> Екология и опазване на околната среда<br>" +
            "-> Приложна геофизика<br>" +
            "-> Сондиране, добив и транспорт на нефт и газ<br>" +
            "-> Хидрогеология и инженерна геология";
        }
        else if (containsKeyword(userInput, ["Какви магистърски програми има в МГУ?"]))
        {
            botMessage.innerHTML = "За да разберете какви магистърски програми предлага МГУ, моля натиснете опция 4.<br>" +
            "<br>" +
            "-> Газоснабдяване<br>" +
            "-> Биотехнологии<br>" +
            "-> Автоматика, информационна и управляваща техника<br>" +
            "-> Газова, горивна и пречиствателна техника и технологии<br>" +
            "-> Геоинформатика<br>" +
            "-> Геотехника<br>" +
            "-> Електромобили<br>" +
            "-> Екология и опазване на околната среда<br>" +
            "-> Електроенергетика и електрообзавеждане с възобновяеми източници на енергия<br>" +
            "-> Икономическа геология<br>" + 
            "-> Икономика на изкопаемите горива<br>" + 
            "-> Електроенергетика и електрообзавеждане в мините<br>" +
            "-> Инженерна геология<br>" +
            "-> Индустриален мениджмънт<br>" +
            "-> Инженерна безопасност<br>" +
            "-> Машини, апарати и съоръжения за промишлена и битова газификация<br>"+
            "-> Компютърни технологии в инженерната дейност<br>"+
            "-> Механизация за преработка на минерални суровини<br>"+
            "-> Механизация на добива и транспорта на минерални суровини<br>"+
            "-> Мениджмънт и третиране на отпадъци<br>"+
            "-> Оценка на екологичния риск и устойчиво развитие<br>"+
            "-> Петролна геология<br>"+
            "-> Открито разработване на полезни изкопаеми<br>"+
            "-> Подземно разработване на полезни изкопаеми<br>"+
            "-> Подземно строителство<br>"+
            "-> Петролна геофизика<br>"+
            "-> Приложна минералогия<br>"+
            "-> Проучвателна геофизика<br>"+
            "-> Управление на твърди и течни отпадъци<br>"+
            "-> Техника и технология на взривните работи<br>"+
            "-> Управление качеството на водите<br>"+
            "-> Хидрогеология<br>"+
            "-> Управление на добива и преработката на минерални суровини и въглища<br>"+
            "-> Техника и технология на взривните работи - производство на взривни материали<br>"+
            "-> Управление на газовата инфраструктура<br>"+
            "-> Геоинформационни системи при управление на земи и природни ресурси<br>"+
            "-> Възстановяване на нарушени ландшафти<br>"+
            "-> Маркшайдерско осигуряване, поддръжка и дигитализация на подземната инфраструктура";
        }
        else if (containsKeyword(userInput, ["Какви докторски програми има в Университета?"]))
        {
            botMessage.innerHTML = "За да разберете какви докторски програми предлага МГУ, моля натиснете опция 5.<br>" +
            "<br>" +
            "-> И и Управление на минното производство<br>" +
            "-> Хидрогеология<br>" +
            "-> Инженерна геология<br>" +
            "-> Минералогия и кристалография<br>" +
            "-> Петрология<br>" +
            "-> Палаонтология и стратиграфия<br>" +
            "-> Регионална геология<br>" +
            "-> Геотектника<br>" +
            "-> Екология и опазване на екосистемите<br>" +
            "-> Технология за пречистване на води<br>" +
            "-> Технология за оползотворяване и третиране на отпадъци<br>" +
            "-> системи и устройства за опзване на околната среда<br>" +
            "-> Методи и техника на геоложките изследвания<br>" +
            "-> Автоматозация на производството<br>" +
            "-> Светлинна техника и източници на светлина<br>" +
            "-> Електроснабдяване и електрообзавеждане<br>" +
            "-> Маркшайдерство и феодезия<br>" +
            "-> Подземно строителство<br>" +
            "-> Техника и технологии на взривните работи - производство на взривни материали<br>" +
            "-> Обща, висша и приложна геодезия<br>" +
            "-> Подземен добив на полезни изкопаеми<br>" +
            "-> Открит и подводен добив на полезни изкопаеми<br>" +
            "-> Механизация на мините<br>" +
            "-> Техника и технология на взривните работи<br>" +
            "-> Техника и технология на сондирането<br>" +
            "-> Разработка и експлоатация на нефтени, газови и газокондензатни находища<br>" +
            "-> Техника на безопасността на труда и противопожарна техника<br>" +
            "-> Компютърни технологии в инженерната дейност";
        }
        else if (containsKeyword(userInput, ["Къде мога да се реализирам след като завърша МГУ?"]))
        {
            botMessage.innerHTML = "След като завършите в МГУ, може да работите в държавни институции и частни фирми като експерт, ръководители. Може да участвате в разработване на национални-международни проекти. Да ръководите организации с предмет на дейността, която сте завършили. Да заемате ръководни позиции в Дружества и организации както в държавна администрация, в отдели по проучване и маркетинг така и в застрахователни и други институции. Да организирате и изграждате минни обекти в България и чужбина. Да ръководите фирми извършващи подземно градско, транспортно и хидроенергийно строителство.<br>" + 
            "Да проучвате пазари и да разработвате успешни маркетингови стратегии и политики на бизнес организации във всяка индустрия. Да бъдете търговци или консултанти при доставка на газова и горивна техника. Да извършвате контрол на екологични инсталации за използване на промишлени и битови отпадъци.<br>" +
            "Може да се реализирате и във фирмите-партньори на университета.";
        }
        else if (containsKeyword(userInput, ["С какви базови съоръжения разполага университета?"]))
        {
            botMessage.textContent = "Университета разполага със спортна зала, библиотека, зала АУЛА МАКСИМА, център за кариерно развитие, Висша Школа за взривни работи, CISCO Академия, студентски иновационен център, Музей и Параклис. Всеки факултет разполага с лабораторен блок.";
        }
        else if (containsKeyword(userInput, ["Какви са таксите за обучение и за кандидастване в Университета?"]))
        {
            botMessage.textContent = "Таксите за кандидастване и за бакалаври и за магистри е 50лв. обучението за редовна форма на бакалавър е 840лв. за редовно и за задочно обучение, а за магистър е 900лв. за редовно и за задочно обучение.";
        }
        else if (containsKeyword(userInput, ["Предвидена ли е стипендия за бакалаври и магистри?"]))
        {
            botMessage.textContent = "Да, имаме стипендия, която се определя спрямо успеха, социална стипендия и стипендия тип Дарение от фирмите-партньори на МГУ. Стипендия от оценка от ДЗИ за определени професионални направления. Стипендиите са само за редовно обучение по държавна поръчка.";
        }
        else if (containsKeyword(userInput, ["Мога ли да кандидаствам по програма Еразъм за обмен на студенти?"]))
        {
            botMessage.textContent = "Да можете, нашия Университет участва в програмата с цел обучение на студенти и преподавателска мобилност.";
        }
        else if (containsKeyword(userInput, ["Има ли общежития в МГУ?"]))
        {
            botMessage.textContent = "Да, има и кандидастването става чрез попълването на формуляр на място в университета.";
        }
        else 
        {
            botMessage.textContent = "Нямам информация относно този въпрос към момента. Свържете се с администрацията на телефон: 025884954";
        }

        chatBox.appendChild(botMessage);

        // Scroll to the bottom of the chat box to show the latest message
        chatBox.scrollTop = chatBox.scrollHeight;
    }, 3000); // Delay in milliseconds (3 seconds in this case)
}

// Helper function to check if user input contains any of the specified keywords
function containsKeyword(input, keywords) {
    // input = input.toLowerCase(); OPTIONAL IF NEEDED FOR LOWERCASE.
    for (var i = 0; i < keywords.length; i++) {
        if (input.includes(keywords[i])) {
            return true;
        }
    }
    return false;
}